---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalLinkType
source: html/9362135d-6ea6-ff5a-e026-b6c247a497a1.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLinkType

An object that specifies the analysis properties for an AnalyticalLink element.

## Syntax (C#)
```csharp
public class AnalyticalLinkType : ElementType
```